benchmark_results_replicated/20260423_101844/analysis/rep14/run/go_heavy_c10/wrk_output.txt
Running 1m test @ http://localhost:8080/days-since-heavy
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.75ms   29.03ms  99.28ms   78.49%
    Req/Sec   190.12     42.43   353.00     70.17%
  Latency Distribution
     50%    2.15ms
     75%   44.23ms
     90%   71.52ms
     99%   91.48ms
  45509 requests in 1.00m, 6.12MB read
Requests/sec:    757.39
Transfer/sec:    104.29KB
P95: 83373
P99: 91482